
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Hidden Adventures</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<link href="readme/bgreadme.css" type="text/css" rel="stylesheet" />
</head>
<body>

<table border="0" width="100%" cellpadding="0" cellspacing="0" align="center">
<tr>
	<td align="center"><a href="http://www.baldurs-gate.eu"><img src="readme/BannerSword.png" border="0" alt="Baldur's Gate Forum" /></a></td>
	<td align="right">
		&nbsp;
	</td>
</tr>

</table>
<h1>Hidden Adventures</h1>
<div class="section"> 
  <p><strong><a href="https://www.baldurs-gate.de/index.php">Eine Kerzenburgforum-Modifikation</a><br />  </strong>
    Author: Lumorus<br />
	Coder: White Agnus, jastey<br />
    <strong> Sprachen:</strong> Deutsch, Englisch, Russisch<br />
    <strong>Platform: </strong>Windows</p> 
  <p>Hidden Adventures ist ein Quest/Tweak Mod f&uuml;r Baldur's Gate 2 (BGII, BGT, BGII:EE, EET)</p>
</div>


<h2>Inhalt</h2>
<div class="section">
  <ol>
    <li><a href="#install">Installation</a></li>
    <li><a href="#compat">Kompatiblit&auml;t mit anderen Mods</a></li>
    <li><a href="#content">Inhalt</a>
      <ul> 
        <li><a href="#ladyelgea">Erweiterte Handlung um Lady Elgea</a> </li>
		<li><a href="#anomen">Erweiterte Anomenhandlung</a> </li>
		<li><a href="#jerlia">Jerlias Erzladen</a> </li>
		<li><a href="#heilwasser">Elfisches heiliges Wasser im Lathander Tempel</a> </li>
		<li><a href="#wellenklinge">Wellenklinge in Schatzkammer</a> </li>
		<li><a href="#silberdolch">Silberdolch in Irenicus Dungeon</a> </li>
		<li><a href="#bardenfeste">Barden k&ouml;nnen in ihrer Feste (5 Kr&uuml;gen) &uuml;bernachten</a> </li>
		<li><a href="#barde">Ein Barde f&uuml;r die Bardenfestung</a> </li>
		<li><a href="#Silberschwert">Silberschwert gegen Gedankenschinder und Lykanthropen</a> </li>
		<li><a href="#saradushtunnel">Ein Tunnel f&uuml;r Saradush</a> </li>
		<li><a href="#masktemple">Tempel des Mask im Hafenviertel</a> </li>
      </ul> 
    </li> 
    <li><a href="#acknow">Danksagungen</a></li> 
    <li><a href="#credit">Copyright</a></li>
    <li><a href="#version">Versionsgeschichte</a> </li> 
  </ol> 
</div> 

<h1><a name="install" id="install">Installation</a></h1>
<div class="section">
Entpackt den Ordner "hiddenadventure" und die "setup-hiddenadventure.exe" in Euer BG2/BGT/BGII:EE/EET Verzeichnis und folgt den Anweisungen auf dem Bildschirm.<br />
<br />
Falls Ihr Probleme bei der Installation habt, wendet Euch bitte f&uuml;r Hilfe ins <a href="https://www.baldurs-gate.de/index.php">Kerzenburgforum</a> oder <a href="https://www.gibberlings3.net/">The Gibberlings Three (englisch)</a>.
</div>

<h1><a name="compat" id="compat">Hinweise zur Kompatiblit&auml;t</a></h1>
<div class="section">
Hidden Adventure wurde mit WeiDU umgesetzt und sollte mit jedem anderem Weidu Mod kompatibel sein.<br />
"Silberdolch in Irenicus Dungeon" ben&ouml;tigt BGT oder EET um installiert werden zu k&ouml;nnen.<br />
Die Kompatiblit&auml;t zu anderen Mods sollte gegeben sein, es ist geplant, teilweise bereits auch umgesetzt, dass Crossmod Inhalte f&uuml;r andere Mods beinhaltet sind, diese Mods m&uuml;ssen nat&uuml;rlich vor Hidden Adventure installiert werden.<br />
Die "Erweiterte Anomenhandlung" sollte nach <a href="https://www.baldurs-gate.de/index.php?resources/jasteys-sir-ajantis-f%C3%BCr-bgii-npc.9/">"Jasteys Ajantis f&uuml;r BG2"</a>, <a href="http://www.gibberlings3.net/npctweak/">"NPC Tweak"</a> und <a href="http://www.weidu.org/item.html">"Weimers Item Upgrade Mod"</a> installiert werden, da sich in der Komponente Crossmod Inhalte dazu befinden.
</div>

<h1><a name="content" id="content">Inhalt</a></h1>
<div class="section">
Hidden Adventure war urspr&uuml;nglich als Questmod f&uuml;r BGT gedacht, welche besonders im BG2-Teil lose gelassene und offene Enden aufgreifen und abschlie&szlig;en sollte. <br />
Schlie&szlig;lich entwickelte sich die Planung in die Richtung, dass auch verschiedene Tweaks hinzugef&uuml;gt wurden.<br />
<br />
Die Mod bietet momentan folgenden Inhalt:
<h2> <a name="ladyelgea" id="ladyelgea">Erweiterte Handlung um Lady Elgea</a></h2>
(QUEST ERWEITERUNG)<br /><br />
Die L&ouml;segeldquest um Lady Elgea wird erweitert, sodass auch gute Gruppen die M&ouml;glichkeit haben, an die Silberpantalons zu kommen. Nachdem Lady Elgea freigelassen wurde, erscheint Welther und &uuml;berreicht das ganz besondere Dankesch&ouml;n!
<h2> <a name="anomen" id="anomen">Erweiterte Anomenhandlung</a></h2>
(QUEST ERWEITERUNG)<br /><br />
Nach der Klassenquest von Anomen, die mit seiner Ritterbeurteilung ihr Ende findet, d&uuml;rfte mancher noch das flaue Gef&uuml;hl eines unerledigten Falles haben ... Wer steckte wirklich hinter Moiras Tod? Hatte Lord Cors Erzfeind Saerk tats&auml;chlich etwas mit dieser ruchlosen Tat zu tun?
Die Gruppe erh&auml;lt nun unter der Bedingung, dass *keine* Romanze mit Anomen vorliegt Gelegenheit, dem Verbrechen auf den Grund zu gehen. Der Weg, dieses R&auml;tsel zu l&ouml;sen h&auml;lt sowohl &uuml;berraschende Wendungen als auch erstaunliche Enth&uuml;llungen parat!
<h2> <a name="jerlia" id="jerlia">Jerlias Erzladen</a></h2>
(TWEAK)<br /><br />
Athkatla ist die Stadt des Goldes ... und Waffen gegen Untote sind hier wirklich mit Gold aufzuwiegen. Bisher musste man entscheiden, ob das Illithium in der Sarles-Quest abgegeben wurde oder zum Schmieden einer besonderen Waffe gegen Untote verwendet wird.<br />
Besorgt man nun das Illthium, bekommt man nicht nur das Material für Sir Sarles, sondern die Erzh&auml;ndlerin Jerlia kann endlich wieder ihren Laden er&ouml;ffnen! Damit gibt es die M&ouml;glichkeit, auch als ehrlicher Charakter an weiteres Illithium zu kommen, um die ultimative Waffe gegen Untote zu schmieden!
<h2> <a name="heilwasser" id="heilwasser">Elfisches heiliges Wasser im Lathander Tempel</a></h2>
(TWEAK)<br /><br />
Als m&auml;chtige Waffe gegen Vampire - und Bestandteil eines besonderen Schmiederezeptes ist das Elfische heilige Wasser normalerweise leider sehr selten zu bekommen ... 
Diese Komponente f&uuml;gt nun das Weihwasser auch im Lathandertempel ein.
(in Zukunft ist geplant, das Elfische Heilige Wasser zu einem anderen H&auml;ndler wechseln zu lassen, da dessen Rolle in der Rogue Rebalancing Mod ihn zu der logischeren Quelle macht.)
<h2> <a name="wellenklinge" id="wellenklinge">Wellenklinge in Schatzkammer</a></h2>
(TWEAK)<br /><br />
Prinz oder K&ouml;nig - das war immer schon die Frage in der Unterwasserstadt der Sahuagin!<br />
Um die Entscheidung, wem man hilft etwas neutraler zu gestalten (m&ouml;chte man die Hellebarde "Welle" fertigstellen war es eindeutig von Vorteil, den Prinzen zu t&ouml;ten) wurde die Klinge der Hellebarde in die Schatzkammer verschoben. Egal, für wen man ist - die Klinge geht auf jeden Fall an die Gruppe!
<h2> <a name="silberdolch" id="silberdolch">Silberdolch in Irenicus Dungeon</a></h2>
(TWEAK)<br /><br />
Hat sich der Silberdolch schon auf der Werwolfinsel sehr bew&auml;hrt, soll er der Gruppe weiterhin eine Hilfe sein, wenn sie Schatten of Amn gegen Wolfwere und besonders H&ouml;here Wolfwere k&auml;mpft.
<br />
Bisher ist der Dolch die erste Waffe, welche diese Komponente nach Schatten von Amn importiert - es ist geplant noch weitere hinzuzuf&uuml;gen, welche mit dem HC in besonderer Verbindung stehen und mehr ... oder weniger n&uuml;tzlich sind! <br />
<br />
Diese Komponente ist nur f&uuml;r BGT und EET installierbar.
<h2> <a name="bardenfeste" id="bardenfeste">Barden k&ouml;nnen in ihrer Feste (5 Kr&uuml;gen) &uuml;bernachten</a></h2>
(TWEAK)<br /><br />
Lange waren Barden die einzige Charakterklasse, die NICHT kostenlos in ihrer eigenen Festung &uuml;bernachten konnten, wann sie wollten. Eine Ungerechtigkeit, die der Vergangenheit angeh&ouml;rt - schlie&szlig;lich sollte ein Lieblingsbarde, wie Samuel immer sagt, auch besondere Privilegien genie&szlig;en, nicht wahr?
<h2> <a name="barde" id="barde">Ein Barde f&uuml;r die Bardenfestung</a></h2>
(QUEST)<br /><br />
Was tun, wenn die Theatergruppe befreit wurde und in ihre Heimat zur&uuml;ckgekehrt ist - und der HC kein Barde ist?... <br />
Ehe das Theater ohne Leitung versauert, gibt es nun eine M&ouml;glichkeit, einen Ersatz-Theaterleiter zu finden, welcher das Managment des Theaters unter den F&uuml;nf Kr&uuml;gen &uuml;bernehmen wird.<br />
Man suche den verkannten Musiker auf der Promenade, wenn man seinem tristen Dasein eine hellere Note geben m&ouml;chte!
<h2> <a name="Silberschwert" id="Silberschwert">Silberschwert gegen Gedankenschinder und Lykanthropen</a></h2>
(TWEAK)<br /><br />
Silber sollte eigentlich gegen Werw&ouml;lfe helfen ... sollte man zumindest meinen. Leider war dies zuvor bei dem Silberschwert der Githyanky nie der Fall - ebenso wenig die Tatsache, dass es besonders effektiv gegen Gedankenschinder sein sollte, gegen die es eigentlich &uuml;berhaupt erst geschmiedet wurde.
Gerade dahinter steckte die Idee für diesen Tweak, um diese Umst&auml;nde zu &auml;ndern und das Silberschwert zu einer guten Waffe gegen diese beiden Gegnertypen zu machen: Das Silberschwert bekommt Boni gegen Lykanthropen und eine spezielle Eigenschaft gegen Gedankenschinder.
<h2> <a name="saradushtunnel" id="saradushtunnel">Ein Tunnel f&uuml;r Saradush, von Jastey</a></h2>
(QUEST)<br /><br />
Wer wollte nicht schon immer den armen B&uuml;rgern retten, ehe die Armeen Yaga-Shuras die belagerte Stadt Saradush &uuml;berrannten? Teleportieren ging nicht, da die Magier des Feuerriesen entsprechende Ma&szlig;nahmen getroffen hatten...
Eine L&ouml;sung für dieses Problem bietet diese Komponente, die eigentlich als eigenst&auml;ndige Modifikation gedacht war: Der HC hat nun die Chance, den normalen Einwohnern von Saradush die M&ouml;glichkeit zu geben, vor den Bhaalunruhen in Sicherheit zu fliehen! Hierzu muss erst Librarius' Zauberbuch wiederbeschafft werden, danach steht er f&uuml;r die n&ouml;tige Magie zur Verf&uuml;gung.
<h2> <a name="masktemple" id="masktemple">Tempel des Mask im Hafenviertel, von Jastey und Jarl</a></h2>
(TWEAK)<br /><br />
F&uuml;gt einen Tempel des Mask in das Hafenviertel ein. Er befindet sich hinter dem Torbogen am Haus der Schattendiebe. Es werden normale Tempeldienste angeboten.
</div>

<h1><a name="acknow" id="acknow">Danksagungen</a></h1>
<div class="section">
Wir danken BioWare, Black Isle und Wizards of the Coast f&uuml;r Baldur's Gate 1, 2 und die Infinity Engine und BeamDog für die Neuauflage der Spiele.
Sir Darian, Tim und Vernochan f&uuml;r die Leitung des Kerzenburgforums, der wohl besten deutschen Baldurs Gate Community
Jastey und Wedge f&uuml;r Ihre Kommentare und Verbesserungsvorschl&auml;ge
Westley Weimer, The Bigg, Wisp und alle die an Weidu mitgearbeitet haben
Jon Olav Hauglid, Fredrik Lindgren, Taimon, The Bigg, FredSRichardson, Argent77, Jurgen00, Sam und alle sonstigen die an NearInfinity gerabeitet haben
Max/Potencius, Avenger_teambg und alle anderen die an DLTCEP mitgearbeitet haben
Bardez, Ascension64 und King Diamond f&uuml;r BGT
Leonardo Watson f&uuml;r das BWP
k4thos und alle Beteiligten f&uuml;r EET
Allen Moddern rund um die Infinity Engine, die man hier nicht alle einzeln aufz&auml;hlen kann
Den Spielern, die in Zukunft unsere Mod spielen und durch Bugreports uns helfen das ganze zu verbessern
</div>

<h1><a name="credit" id="credit">Copyright</a></h1>
<div class="section">
Hidden Adventures f&uuml;r Baldur's Gate II ToB / BGT von Lumorus und White Agnus. &copy; 2013-2014<br />
This mod is unofficial Fan Content permitted under the Fan Content Policy. Not approved/endorsed by Wizards. Portions of the materials used are property of Wizards of the Coast. ©Wizards of the Coast LLC.
This mod is also not developed, supported, or endorsed by BioWare, Black Isle Studios, Interplay Entertainment Corp., Overhaul Games or Beamdog. All other trademarks and copyrights are property of their respective owners.
</div> 

<h1><a name="version" id="version">Versionsgeschichte</a></h1>
<div class="section">
<h2>Alpha Versionen:</h2>
Alpha 1:<br />
(keine &ouml;ffentliche Version)<br />
- Einf&uuml;hrung "Erweiterte Handlung um Lady Elgea"<br />
<br />
Alpha 2:<br />
(keine &ouml;ffentliche Version)<br />
- Namensgebung des Mods<br />
- Beschreibungsfix f&uuml;r Pantalons (Erweiterte Handlung um Lady Elgea)<br />
- Einf&uuml;hrung "Ein besorgter Bauer"<br />
<br />
Alpha 3:<br />
(keine &ouml;ffentliche Version)<br />
- Einf&uuml;hrung "Erweiterte Anomenhandlung"<br />
<br />
Alpha 4:<br />
(keine &ouml;ffentliche Version)<br />
- Einf&uuml;hrung "Jerlias Erzladen", "Wellenklinge in der Schatzkammer", "Elfisches heiliges Wasser im Lathander Tempel", "Silberdolch in Irenicus Dungeon"<br />
- Tagebucheintr&auml;ge gefixt (Ein besorgter Bauer)<br />
<br />
Alpha 5:<br />
(keine &ouml;ffentliche Version)<br />
- Einf&uuml;hrung "Barden k&ouml;nnen in ihrer Feste (5 Kr&uuml;gen) &uuml;bernachten"<br />
- Erweiterung "Erweiterte Anomenhandlung"<br />
<br />
Alpha 6:<br />
(keine &ouml;ffentliche Version)<br />
- Einf&uuml;hrung "Barden f&uuml;r die Bardenfestung", "Silberschwert gegen Gedankenschinder und Lykanthropen", "Leichen f&uuml;r einen guten Zweck"<br />
<br />
Alpha 7:<br />
(keine &ouml;ffentliche Version)<br />
- Erweiterung "Erweiterte Anomenhandlung"<br />

<h2>Beta Versionen:</h2>
<br />
Beta 1:</br>
- Komplette Umstrukturierung der "Erweiterten Anomenhandlung"<br />
- Traify der Files<br />
<br />
Beta 2:<br />
- Englische Version von Nightfarer & Jastey eingef&uuml;gt<br />
- Quest "Ein Tunnel f&uuml;r Saradush" von jastey eingefügt <br />
- Kleinere &Uuml;berarbeitungen und Rechtschreibkorrekturen <br />
<br />
Beta 3:<br />
- Neue Komponente "Tempel des Mask im Hafenviertel" eingef&uuml;gt<br />
- Anomen Quest: Text etwas ver&auml;ndert um die Zeitschiene zu vereinheitlichen <br />
<br />
Beta 4:<br />
- Anomen Quest: Stutter Bug korrigiert, Goldbetrag der Belohnung korrigiert, kleinere Änderungen<br />
- Verwendung des Taggs "CHARNAME" korrigiert<br />
- (crossmod) Anomen sollte seinen Familienschild und Helm tragen können  <br />
- setup-hiddenadventure.tp2 umbenannt in hiddenadventure.tp2 <br />
- hiddenadventure.ini mit Modinfo eingefügt<br />
- (EE) Areas verwenden pvrz-Format (keine schwarzen Linien mehr) <br />
<br />
Beta 5:<br />
- Russian version by yota13 added.<br />
- English version proof read by Lauriel.<br />
- "Anomen's extended plot": Timer until quest starts shortened to two ingame days.<br />
- "Anomen's extended plot": Anomen will not repeat one of his lines when leaving Saerk's house again.<br />
- "Anomen's extended plot": Suraya will not say her reply to Haer'Dalis' comment if he is not there.<br />
- "Anomen's extended plot": Anomen should be able to wear his family helmet (crossmod with NPC Tweaks)<br />
<br />
Beta 6:<br />
- Compatibility with Golem Construction Mod added (v6.2 or higher).<br />
<br />
<br />
</div>

</body>